name: "TransformParamsLayer_test"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 10 dim: 3 dim: 227 dim: 227 } }
}
layer {
  name: "transform_param"
  type: "Python"
  bottom: "data"
  top: "transform_param"
  python_param {
    module: "TransformParamsLayer"
    layer: "TransformParamsLayer"
    param_str: "{'split': 'train', 'mean_shape': 128}"
  }
}
